wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/doc/DA14681-00.xml
# $software_scratch@retention_ram
# TX ram not used by hardware, can be used by software as scratch ram with retention. </description>
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ISPANID_COORD_ERROR</name>
	<description>Received frame not for PAN coordinator, applicable when frame is not discarded </description>
	<access>read-only</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SPANID_ERROR</name>
	<description>PAN ID error, applicable when frame is not discarded </description>
	<access>read-only</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DADDR_ERROR</name>
	<description>D Address error, applicable when frame is not discarded </description>
	<access>read-only</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DPANID_ERROR</name>
	<description>D PAN ID error, applicable when frame is not discarded </description>
	<access>read-only</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RES_FRM_VERSION_ERROR</name>
	<description>Not supported frame version error, applicable when frame is not discarded. </description>
	<access>read-only</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RES_FRM_TYPE_ERROR</name>
	<description>Not supported frame type error, applicable when frame is not discarded </description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CRC16_ERROR</name>
	<description>CRC error, applicable for transparent mode only </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_STATUS_DELTA_REG</name>
	<description>Receive status delta register</description>
	<addressOffset>0x00010220</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>RX_BUFF_IS_FULL_D</name>
	<description>Delta bit of status &amp;quot;rx_buff_is_full&amp;quot; </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_STATUS_MASK_REG</name>
	<description>Receive status delta mask register</description>
	<addressOffset>0x00010224</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>RX_BUFF_IS_FULL_M</name>
	<description>Mask bit of status &amp;quot;rx_buff_is_full&amp;quot; </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_RX_STATUS_REG</name>
	<description>Receive status register</description>
	<addressOffset>0x0001020c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>RX_WRITE_BUF_PTR</name>
	<description>Indication where new data will be written.
All four bits shall be used when using these pointer values (0d - 15d).
However, the Receive Packet buffer has a size of 8 entries.
So reading the Receive Packet buffer entries shall use the mod8 of the pointer values. </description>
	<access>read-only</access>
	<bitRange>[4:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>RX_BUFF_IS_FULL</name>
	<description>Indicates that the Rx packet buffer is full </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SECKEY_0_REG</name>
	<description>Seckey register</description>
	<addressOffset>0x00010118</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SECKEY_0</name>
	<description>Registers secKey[0..3] contain the key to be used. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SECKEY_1_REG</name>
	<description>Seckey register</description>
	<addressOffset>0x0001011c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SECKEY_1</name>
	<description>See register &amp;quot;secKey_0&amp;quot; </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SECKEY_2_REG</name>
	<description>SecKey register</description>
	<addressOffset>0x00010120</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SECKEY_2</name>
	<description>See register &amp;quot;secKey_0&amp;quot; </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SECKEY_3_REG</name>
	<description>Seckey register</description>
	<addressOffset>0x00010124</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SECKEY_3</name>
	<description>See register &amp;quot;secKey_0&amp;quot; </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SECNONCE_0_REG</name>
	<description>Nonce register used for encryption/decryption</description>
	<addressOffset>0x00010128</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SECNONCE_0</name>
	<description>Register secNonce[0..3] contains the Nonce to be used for encryption/decryption. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SECNONCE_1_REG</name>
	<description>Nonce register used for encryption/decryption</description>
	<addressOffset>0x0001012c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SECNONCE_1</name>
	<description>See register &amp;quot;Nonce_0&amp;quot; </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SECNONCE_2_REG</name>
	<description>Nonce register used for encryption/decryption</description>
	<addressOffset>0x00010130</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SECNONCE_2</name>
	<description>See register &amp;quot;Nonce_0&amp;quot; </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SECNONCE_3_REG</name>
	<description>Nonce register used for encryption/decryption</description>
	<addressOffset>0x00010134</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>SECNONCE_3</name>
	<description>See register &amp;quot;Nonce_0&amp;quot; </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SECURITY_0_REG</name>
	<description>Security register</description>
	<addressOffset>0x00010110</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SECENCDECN</name>
	<description>The control register secEncDecn indicates whether to encrypt ('1') or decrypt ('0') the data. </description>
	<access>read-write</access>
	<bitRange>[31:31]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SECMLENGTH</name>
	<description>The length of the m_data is indicated by control register secMlength. </description>
	<access>read-write</access>
	<bitRange>[30:24]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SECALENGTH</name>
	<description>The length of the a_data is indicated by control register secAlength.
The end of the a_data is the start point of the m_data. (So secAlength must also be set if security level==4) </description>
	<access>read-write</access>
	<bitRange>[22:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SECENTRY</name>
	<description>The UMAC shall indicate by control registers secEntry and secTxRxn which entry to use and if it's from the Tx or Rx buffer ('1' resp. '0'). </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SECTXRXN</name>
	<description>See register &amp;quot;secEntry&amp;quot; </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SECURITY_1_REG</name>
	<description>Security register</description>
	<addressOffset>0x00010114</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>SECENCRFLAGS</name>
	<description>Register secEncrFlags contain the encryption flags field.
Bits [2:0] are the 3-bit encoding flags of a_data, the other bits msut be set to '0'. </description>
	<access>read-write</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SECAUTHFLAGS</name>
	<description>Register secAuthFlags contains the authentication flags fields.
bit[7] is '0'
bit[6] is &amp;quot;A_data present&amp;quot;
bit[5:3]: 3-bit security level of m_data
bit[2:0]: 3-bit security level of a_data. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SECURITY_EVENTMASK_REG</name>
	<description>security event mask register</description>
	<addressOffset>0x00010154</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>SECREADY_M</name>
	<description>Mask bit for event &amp;quot;secReady_e&amp;quot;. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SECURITY_EVENT_REG</name>
	<description>security event register</description>
	<addressOffset>0x00010150</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>SECREADY_E</name>
	<description>The Event bit secReady_e is set when the authentication process is ready (i.e. secBusy is cleared).
This Event shall contribute to the gen_irq. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SECURITY_OS_REG</name>
	<description>One shot register to start encryption/decryption</description>
	<addressOffset>0x00010138</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields>
	<field>
	<name>SECSTART</name>
	<description>One_shot register to start the encryption, decryption and authentication support task. </description>
	<access>write-only</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SECABORT</name>
	<description>See register &amp;quot;Nonce_0&amp;quot; </description>
	<access>write-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SECURITY_STATUS_REG</name>
	<description>Security status register</description>
	<addressOffset>0x00010140</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields>
	<field>
	<name>SECAUTHFAIL</name>
	<description>In case of decryption, the status bit secAuthFail will be set when the authentication has failed. </description>
	<access>read-only</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SECBUSY</name>
	<description>Register &amp;quot;secBusy&amp;quot; indicates if the encryption/decryption process is still running. </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SYMBOLTIME2THR_REG</name>
	<description>Symboltime threshold register 2</description>
	<addressOffset>0x00010384</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SYMBOLTIME2THR</name>
	<description>Symboltime 2 Threshold to generate a general interrupt </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SYMBOLTIMESNAPSHOTVAL_REG</name>
	<description>Value timestamp generator</description>
	<addressOffset>0x00010210</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SYMBOLTIMESNAPSHOTVAL</name>
	<description>The Status register SymbolTimeSnapshotVal indicates the actual value of the TimeStamp generator. </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SYMBOLTIMETHR_REG</name>
	<description>Symboltime threshold register 1</description>
	<addressOffset>0x00010380</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SYMBOLTIMETHR</name>
	<description>Symboltime Threshold to generate a general interrupt </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SYNCTIMESTAMPPHASEVAL_REG</name>
	<description>Timestamp phase value regsiter</description>
	<addressOffset>0x00010320</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>SYNCTIMESTAMPPHASEVAL</name>
	<description>Value to sync TS gen phase within a symbol with.
Please note the +1 correction needed for most accurate result (+0.5 is than the average error, resulting is a just too fast clock). </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SYNCTIMESTAMPTHR_REG</name>
	<description>Threshold timestamp generator</description>
	<addressOffset>0x00010304</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SYNCTIMESTAMPTHR</name>
	<description>Threshold for synchronize TS gen.
Note that due to implementation this register may only be written once per two LP_CLK periods. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_SYNCTIMESTAMPVAL_REG</name>
	<description>Value timestamp generator</description>
	<addressOffset>0x00010308</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>SYNCTIMESTAMPVAL</name>
	<description>Value to sync TS gen with. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TIMER_CONTROL_1_REG</name>
	<description>Timer control register</description>
	<addressOffset>0x0001030c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000002</resetMask>
	<fields>
	<field>
	<name>SYNCTIMESTAMPENA</name>
	<description>If set, the TimeStampThr is enabled to generate a sync of the TS gen. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TIMESTAMPCURRPHASEVAL_REG</name>
	<description>Value of timestamp generator phase within a symbol</description>
	<addressOffset>0x00010074</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>TIMESTAMPCURRPHASEVAL</name>
	<description>Value of captured TS gen phase within a symbol </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TIMESTAMPCURRVAL_REG</name>
	<description>Value of timestamp generator</description>
	<addressOffset>0x0001005c</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TIMESTAMPCURRVAL</name>
	<description>Value of captured TS gen </description>
	<access>read-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TSCH_CONTROL_0_REG</name>
	<description>Lmac tsch control register</description>
	<addressOffset>0x00010160</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x089803e8</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACTSRXWAIT</name>
	<description>The times to wait for start of frame </description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACTSTXACKDELAY</name>
	<description>End of Rx frame to start of Ack </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TSCH_CONTROL_1_REG</name>
	<description>Lmac tsch control register</description>
	<addressOffset>0x00010164</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x000000c0</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MACTSRXTX</name>
	<description>The time between the CCA and the TX of a frame </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TSCH_CONTROL_2_REG</name>
	<description>Lmac tsch control register</description>
	<addressOffset>0x00010168</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x01900320</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>MACTSACKWAIT</name>
	<description>The minimum time to wait for start of an Acknowledgement </description>
	<access>read-write</access>
	<bitRange>[31:16]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACTSRXACKDELAY</name>
	<description>End of frame to when the transmitter shall listen for Acknowledgement </description>
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TXBYTE_E_REG</name>
	<description>Transmit first byte register</description>
	<addressOffset>0x00010394</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields>
	<field>
	<name>TX_LAST_SYMBOL_E</name>
	<description>Indicates the last symbol of a frame is transmitted </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TXBYTE_E</name>
	<description>Indicates the first byte of a frame is transmitted </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TXBYTE_M_REG</name>
	<description>Transmit first byte mask register</description>
	<addressOffset>0x00010398</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000003</resetMask>
	<fields>
	<field>
	<name>TX_LAST_SYMBOL_M</name>
	<description>Mask bit for event &amp;quot;tx_last_symbol_e&amp;quot;. </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TXBYTE_M</name>
	<description>Mask bit for event &amp;quot;txbyte_e&amp;quot;. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TXPIPEPROPDELAY_REG</name>
	<description>Prop delay transmit register</description>
	<addressOffset>0x00010034</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>TXPIPEPROPDELAY</name>
	<description>Prop delay of tx pipe, start to DPHY </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_CLEAR_OS_REG</name>
	<description>One shot register to clear flag</description>
	<addressOffset>0x00010484</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000000f</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR</name>
	<description>To clear tx_flag_stat </description>
	<access>write-only</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_CONTROL_0_REG</name>
	<description>Transmit control register</description>
	<addressOffset>0x00010240</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00004350</resetValue>
	<resetMask>0x00007ff1</resetMask>
	<fields>
	<field>
	<name>MACMAXCSMABACKOFFS</name>
	<description>Maximum number of CSMA-CA backoffs
