wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/doc/DA14681-00.xml
(range 0-5) </description>
	<access>read-write</access>
	<bitRange>[14:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACMINBE</name>
	<description>Minimum Backoff Exponent (range 0-macMaxBE) </description>
	<access>read-write</access>
	<bitRange>[11:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MACMAXBE</name>
	<description>Maximum Backoff Exponent (range 3-8) </description>
	<access>read-write</access>
	<bitRange>[7:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DBGTXTRANSPARENTMODE</name>
	<description>If 1, the MPDU octets pass transparently through the MAC in the transmit direction (for debug purpose). </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_FIFO_0_0_REG</name>
	<description>Address transmit fifo 0</description>
	<addressOffset>0x00000000</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TX_FIFO</name>
	<description>Transmit fifo buffer, contains 32 addresses per entry (32b x 32a = 128B). There are 4 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_FIFO_1_0_REG</name>
	<description>Address transmit fifo 1</description>
	<addressOffset>0x00000080</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TX_FIFO</name>
	<description>Transmit fifo buffer, contains 32 addresses per entry (32b x 32a = 128B). There are 4 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_FIFO_2_0_REG</name>
	<description>Address transmit fifo 2</description>
	<addressOffset>0x00000100</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TX_FIFO</name>
	<description>Transmit fifo buffer, contains 32 addresses per entry (32b x 32a = 128B). There are 4 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_FIFO_3_0_REG</name>
	<description>Address transmit fifo 3</description>
	<addressOffset>0x00000180</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>TX_FIFO</name>
	<description>Transmit fifo buffer, contains 32 addresses per entry (32b x 32a = 128B). There are 4 entries supported. </description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_E_0_REG</name>
	<description>Clear flag register 0</description>
	<addressOffset>0x00010404</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR_E</name>
	<description>When the LMAC clears the tx_flag_stat status event bit tx_flag_clear_e is set. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_E_1_REG</name>
	<description>Clear flag register 1</description>
	<addressOffset>0x00010424</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR_E</name>
	<description>When the LMAC clears the tx_flag_stat status event bit tx_flag_clear_e is set. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_E_2_REG</name>
	<description>Clear flag register 2</description>
	<addressOffset>0x00010444</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR_E</name>
	<description>When the LMAC clears the tx_flag_stat status event bit tx_flag_clear_e is set. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_E_3_REG</name>
	<description>Clear flag register 3</description>
	<addressOffset>0x00010464</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR_E</name>
	<description>When the LMAC clears the tx_flag_stat status event bit tx_flag_clear_e is set. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_M_0_REG</name>
	<description>Mask flag register 0</description>
	<addressOffset>0x00010408</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR_M</name>
	<description>Mask bit for event &amp;quot;tx_flag_clear_e&amp;quot;. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_M_1_REG</name>
	<description>Mask flag register 1</description>
	<addressOffset>0x00010428</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR_M</name>
	<description>Mask bit for event &amp;quot;tx_flag_clear_e&amp;quot;. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_M_2_REG</name>
	<description>Clear flag register 2</description>
	<addressOffset>0x00010448</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR_M</name>
	<description>Mask bit for event &amp;quot;tx_flag_clear_e&amp;quot;. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_CLEAR_M_3_REG</name>
	<description>Clear flag register 3</description>
	<addressOffset>0x00010468</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_CLEAR_M</name>
	<description>Mask bit for event &amp;quot;tx_flag_clear_e&amp;quot;. </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_S_0_REG</name>
	<description>Transmit packet ready for transmission register 0</description>
	<addressOffset>0x00010400</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_STAT</name>
	<description>Packet is ready for transmission </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_S_1_REG</name>
	<description>Transmit packet ready for transmission register 1</description>
	<addressOffset>0x00010420</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_STAT</name>
	<description>Packet is ready for transmission </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_S_2_REG</name>
	<description>Transmit packet ready for transmission register 2</description>
	<addressOffset>0x00010440</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_STAT</name>
	<description>Packet is ready for transmission </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_FLAG_S_3_REG</name>
	<description>Transmit packet ready for transmission register 3</description>
	<addressOffset>0x00010460</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000001</resetMask>
	<fields>
	<field>
	<name>TX_FLAG_STAT</name>
	<description>Packet is ready for transmission </description>
	<access>read-only</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_0_0_REG</name>
	<description>Transmit metadata register 0</description>
	<addressOffset>0x00000200</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x57ffffff</resetMask>
	<fields>
	<field>
	<name>CRC16_ENA</name>
	<description>Indicates whether CRC16 insertion must be enabled or not.
0 : No hardware inserted CRC16
1 : Hardware inserts CRC16 </description>
	<access>read-write</access>
	<bitRange>[30:30]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ACKREQUEST</name>
	<description>Indicates whether an acknowledge is expected from the recipient of this packet. </description>
	<access>read-write</access>
	<bitRange>[28:28]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CSMACA_ENA</name>
	<description>Indicates whether a CSMA-CA is required for the transmission of this packet. </description>
	<access>read-write</access>
	<bitRange>[26:26]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FRAMETYPE</name>
	<description>Data/Cmd/Ack etc. Also indicate wakeup frame </description>
	<access>read-write</access>
	<bitRange>[25:23]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_HSI</name>
	<description>HighSide injection. </description>
	<access>read-write</access>
	<bitRange>[22:22]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<access>read-write</access>
	<bitRange>[21:19]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_CALCAP</name>
	<description>CalCap value. </description>
	<access>read-write</access>
	<bitRange>[18:15]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_CN</name>
	<description>Channel Number. </description>
	<access>read-write</access>
	<bitRange>[14:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<access>read-write</access>
	<bitRange>[10:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FRAME_LENGTH</name>
	<description>Frame length </description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_0_1_REG</name>
	<description>Transmit metadata register 1</description>
	<addressOffset>0x00000210</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x57ffffff</resetMask>
	<fields>
	<field>
	<name>CRC16_ENA</name>
	<description>Indicates whether CRC16 insertion must be enabled or not.
0 : No hardware inserted CRC16
1 : Hardware inserts CRC16 </description>
	<access>read-write</access>
	<bitRange>[30:30]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ACKREQUEST</name>
	<description>Indicates whether an acknowledge is expected from the recipient of this packet. </description>
	<access>read-write</access>
	<bitRange>[28:28]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CSMACA_ENA</name>
	<description>Indicates whether a CSMA-CA is required for the transmission of this packet. </description>
	<access>read-write</access>
	<bitRange>[26:26]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FRAMETYPE</name>
	<description>Data/Cmd/Ack etc. Also indicate wakeup frame </description>
	<access>read-write</access>
	<bitRange>[25:23]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_HSI</name>
	<description>HighSide injection. </description>
	<access>read-write</access>
	<bitRange>[22:22]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<access>read-write</access>
	<bitRange>[21:19]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_CALCAP</name>
	<description>CalCap value. </description>
	<access>read-write</access>
	<bitRange>[18:15]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_CN</name>
	<description>Channel Number. </description>
	<access>read-write</access>
	<bitRange>[14:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<access>read-write</access>
	<bitRange>[10:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FRAME_LENGTH</name>
	<description>Frame length </description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_0_2_REG</name>
	<description>Transmit metadata register 2</description>
	<addressOffset>0x00000220</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x57ffffff</resetMask>
	<fields>
	<field>
	<name>CRC16_ENA</name>
	<description>Indicates whether CRC16 insertion must be enabled or not.
0 : No hardware inserted CRC16
1 : Hardware inserts CRC16 </description>
	<access>read-write</access>
	<bitRange>[30:30]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ACKREQUEST</name>
	<description>Indicates whether an acknowledge is expected from the recipient of this packet. </description>
	<access>read-write</access>
	<bitRange>[28:28]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CSMACA_ENA</name>
	<description>Indicates whether a CSMA-CA is required for the transmission of this packet. </description>
	<access>read-write</access>
	<bitRange>[26:26]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FRAMETYPE</name>
	<description>Data/Cmd/Ack etc. Also indicate wakeup frame </description>
	<access>read-write</access>
	<bitRange>[25:23]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_HSI</name>
	<description>HighSide injection. </description>
	<access>read-write</access>
	<bitRange>[22:22]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<access>read-write</access>
	<bitRange>[21:19]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_CALCAP</name>
	<description>CalCap value. </description>
	<access>read-write</access>
	<bitRange>[18:15]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_CN</name>
	<description>Channel Number. </description>
	<access>read-write</access>
	<bitRange>[14:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<access>read-write</access>
	<bitRange>[10:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FRAME_LENGTH</name>
	<description>Frame length </description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_0_3_REG</name>
	<description>Transmit metadata register 3</description>
	<addressOffset>0x00000230</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x57ffffff</resetMask>
	<fields>
	<field>
	<name>CRC16_ENA</name>
	<description>Indicates whether CRC16 insertion must be enabled or not.
0 : No hardware inserted CRC16
1 : Hardware inserts CRC16 </description>
	<access>read-write</access>
	<bitRange>[30:30]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ACKREQUEST</name>
	<description>Indicates whether an acknowledge is expected from the recipient of this packet. </description>
	<access>read-write</access>
	<bitRange>[28:28]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CSMACA_ENA</name>
	<description>Indicates whether a CSMA-CA is required for the transmission of this packet. </description>
	<access>read-write</access>
	<bitRange>[26:26]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FRAMETYPE</name>
	<description>Data/Cmd/Ack etc. Also indicate wakeup frame </description>
	<access>read-write</access>
	<bitRange>[25:23]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_HSI</name>
	<description>HighSide injection. </description>
	<access>read-write</access>
	<bitRange>[22:22]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_RF_GPIO_PINS</name>
	<description>Slot-basis signals mapped on GPIO via PPA. </description>
	<access>read-write</access>
	<bitRange>[21:19]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_CALCAP</name>
	<description>CalCap value. </description>
	<access>read-write</access>
	<bitRange>[18:15]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_CN</name>
	<description>Channel Number. </description>
	<access>read-write</access>
	<bitRange>[14:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>PHYATTR_DEM_PTI</name>
	<description>DEM packet information. </description>
	<access>read-write</access>
	<bitRange>[10:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>FRAME_LENGTH</name>
	<description>Frame length </description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_1_0_REG</name>
	<description>Transmit metadata register 0</description>
	<addressOffset>0x00000204</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>MACSN</name>
	<description>Sequence Number of this packet. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_1_1_REG</name>
	<description>Transmit metadata register 1</description>
	<addressOffset>0x00000214</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>MACSN</name>
	<description>Sequence Number of this packet. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_1_2_REG</name>
	<description>Transmit metadata register 2</description>
	<addressOffset>0x00000224</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>MACSN</name>
	<description>Sequence Number of this packet. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_META_DATA_1_3_REG</name>
	<description>Transmit metadata register 3</description>
	<addressOffset>0x00000234</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>MACSN</name>
	<description>Sequence Number of this packet. </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_PRIORITY_0_REG</name>
	<description>Transmit priority register 0</description>
	<addressOffset>0x00010410</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>ISWAKEUP</name>
	<description>A basic wake-up frame can be generated by the UMAC in the Tx buffer.
The meta data control bit IsWakeUp must be set to indicate that this is a Wake-up frame. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_PRIORITY</name>
	<description>Priority of packet </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_PRIORITY_1_REG</name>
	<description>Transmit priority register 1</description>
	<addressOffset>0x00010430</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>ISWAKEUP</name>
	<description>A basic wake-up frame can be generated by the UMAC in the Tx buffer.
The meta data control bit IsWakeUp must be set to indicate that this is a Wake-up frame. </description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_PRIORITY</name>
	<description>Priority of packet </description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>FTDF_TX_PRIORITY_2_REG</name>
