wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/doc/DA14681-00.xml
	<addressOffset>0x00000036</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MDSTATE_RD</name>
	
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_CALTRIM_STEP4_REG</name>
	
	<addressOffset>0x00000038</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000ffff</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MDSTATE_RD</name>
	<description>Content of the calibration counter </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_FTDF_PHYATTR_REG</name>
	
	<addressOffset>0x00000030</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>FTDF_PHYATTR</name>
	<description>Read out the phyattr bus from the FTDF</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_KMOD_ALPHA_REG</name>
	
	<addressOffset>0x00000018</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x00000fff</resetMask>
	<fields>
	<field>
	<name>KMOD_ALPHA_FTDF</name>
	<description>Kmod channel dependent trimming constant.
0: No trimming is activated
&gt;0: The modulation gain in the direct path is modified with a factor: 1-SGNx(KMOD_ALPHA)x(CN-CN_CAL_RD)/2048</description>
	<access>read-write</access>
	<bitRange>[11:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>KMOD_ALPHA_BLE</name>
	<description>Kmod channel dependent trimming constant.
0: No trimming is activated
&gt;0: The modulation gain in the direct path is modified with a factor: 1-SGNx(KMOD_ALPHA)x(CN-CN_CAL_RD)/2048</description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MGAIN_COMP_VAL0_REG</name>
	
	<addressOffset>0x00000050</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>MGAIN_COMP_VAL</name>
	<description>Intermediate main_cmp_count value</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MGAIN_COMP_VAL1_REG</name>
	
	<addressOffset>0x00000052</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>MGAIN_COMP_VAL</name>
	<description>Intermediate main_cmp_count value</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MGAIN_COMP_VAL2_REG</name>
	
	<addressOffset>0x00000054</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>MGAIN_COMP_VAL</name>
	<description>Intermediate main_cmp_count value</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MGAIN_COMP_VAL3_REG</name>
	
	<addressOffset>0x00000056</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>MGAIN_COMP_VAL</name>
	<description>Intermediate main_cmp_count value</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MGAIN_COMP_VAL4_REG</name>
	
	<addressOffset>0x00000058</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>MGAIN_COMP_VAL</name>
	<description>Intermediate main_cmp_count value</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MGAIN_COMP_VAL5_REG</name>
	
	<addressOffset>0x0000005a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>MGAIN_COMP_VAL</name>
	<description>Intermediate main_cmp_count value</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MGAIN_COMP_VAL6_REG</name>
	
	<addressOffset>0x0000005c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000001f</resetMask>
	<fields>
	<field>
	<name>MGAIN_COMP_VAL</name>
	<description>Intermediate main_cmp_count value</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MGAIN_CTRL2_REG</name>
	
	<addressOffset>0x00000010</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>MGAIN_TRANSMIT_LENGTH</name>
	<description>Number of symbols for transmit0 and transmit1 length during mgain calibration. </description>
	<access>read-write</access>
	<bitRange>[6:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MGAIN_CTRL_BLE_REG</name>
	
	<addressOffset>0x0000000c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>MGAIN_AVER</name>
	<description>Average over a number of comparator output values
0: 1 value
1: 3 values
2: 5 values
3: 7 values </description>
	<access>read-write</access>
	<bitRange>[12:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MGAIN_CMP_INV</name>
	<description>Invert the output of the modulation gain comparator before usage. </description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>BLE_TESTPAT_GEN</name>
	<description>Enable the BLE testpattern generator.
Bitstream can be controlled using RF_MSKMOD_CHIPL/H_REG</description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>GAUSS_GAIN_SEL</name>
	<description>0: Normal operation
1: Use GAUSS_GAIN_WR for the modulation gain </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>GAUSS_GAIN_WR</name>
	<description>Externally provided modulation gain value </description>
	<access>read-write</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MGAIN_CTRL_FTDF_REG</name>
	
	<addressOffset>0x0000000e</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000003</resetValue>
	<resetMask>0x00003f7f</resetMask>
	<fields>
	<field>
	<name>MSK_GAIN_OFFSET</name>
	<description>Signed number, to be added to MSK_GAIN before supplying to the TX_DAC
</description>
	<access>read-write</access>
	<bitRange>[13:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MSK_GAIN_SEL</name>
	<description>0: Normal operation
1: Use MSK_GAIN_WR for the modulation gain </description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MSK_GAIN_WR</name>
	<description>Externally provided modulation gain value </description>
	<access>read-write</access>
	<bitRange>[5:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MSKMOD_CHIPH_REG</name>
	<description>MSK modulator CHIP control upper 16 bit</description>
	<addressOffset>0x00000046</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000744a</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MSK_CHIPH</name>
	
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MSKMOD_CHIPL_REG</name>
	<description>MSK modulator CHIP control lower 16 bit</description>
	<addressOffset>0x00000044</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000c39b</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>MSK_CHIPL</name>
	
	<access>read-write</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MSKMOD_CTRL1_REG</name>
	<description>MSK modulator control register</description>
	<addressOffset>0x00000040</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000000ff</resetMask>
	<fields>
	<field>
	<name>MSK_BYPASS_PHASE</name>
	<description>Bypass the phase calculation.
When set to '1', the CHIP codes are used directly for modulation</description>
	<access>read-write</access>
	<bitRange>[7:7]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_MOD_FROM_GPIO</name>
	<description>Bypass the DAC modulation generation, and take data from GPIO pins TBD</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DISABLE_SDM</name>
	<description>Disable the modulation path to the SDM setting it to midlevel</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DISABLE_DAC</name>
	<description>Disable the modulation path to the TX_DAC, setting it to midlevel</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>INV_SDM_POL</name>
	<description>Invert the polarity to the Sigma Delta Modulator</description>
	<access>read-write</access>
	<bitRange>[3:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>INV_DAC_POL</name>
	<description>Invert the polarity to the TX DAC</description>
	<access>read-write</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_DAC_DELAY</name>
	<description>Delay the modulation towards the DAC, in number of 16 MHz cycles</description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_MSKMOD_CTRL2_REG</name>
	<description>MSK modulator control register</description>
	<addressOffset>0x00000042</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000007f</resetMask>
	<fields>
	<field>
	<name>MSK_ALW_EN</name>
	<description>Always enable the clock to the MSK modulator.
'0' = enable equals (ftdf_mode and synth_enable)</description>
	<access>read-write</access>
	<bitRange>[6:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MSK_TX_SEL</name>
	<description>Select TX_DATA/TX_VALID
0: TX_DATA/TX_VALID from FTDF mac
1: TX_DATA/TX_VALID from RF_MSKMOD_CTRL2_REG</description>
	<access>read-write</access>
	<bitRange>[5:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_VALID</name>
	<description>Test value for TX_VALID</description>
	<access>read-write</access>
	<bitRange>[4:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TX_DATA</name>
	<description>Test value for TX_DATA</description>
	<access>read-write</access>
	<bitRange>[3:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_SYNTH_CTRL1_BLE_REG</name>
	
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00002962</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>PLL_HSI_POL</name>
	<description>High Side Injection polarity
0: LO frequency is lower than the wanted RF frequency
1: LO frequency is higher than the wanted RF frequency </description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CS</name>
	<description>Channel Spacing
0: 1MHz
1: 2MHz </description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SGN</name>
	<description>Sign bit for the channel step
0: positive
1: negative </description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CHANNEL_ZERO</name>
	<description>Channel 0 frequency in MHz </description>
	<access>read-write</access>
	<bitRange>[11:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_SYNTH_CTRL1_FTDF_REG</name>
	
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000965</resetValue>
	<resetMask>0x00007fff</resetMask>
	<fields>
	<field>
	<name>PLL_HSI_POL</name>
	<description>High Side Injection polarity
0: LO frequency is lower than the wanted RF frequency
1: LO frequency is higher than the wanted RF frequency </description>
	<access>read-write</access>
	<bitRange>[14:14]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CS</name>
	<description>Channel Spacing
0: 2.5MHz
1: 5MHz </description>
	<access>read-write</access>
	<bitRange>[13:13]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SGN</name>
	<description>Sign bit for the channel step
0: positive
1: negative </description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CHANNEL_ZERO</name>
	<description>Channel 0 frequency in MHz </description>
	<access>read-write</access>
	<bitRange>[11:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_SYNTH_CTRL2_BLE_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000040b</resetValue>
	<resetMask>0x00001fff</resetMask>
	<fields>
	<field>
	<name>BT_SEL</name>
	<description>0: BT = 0.5; 1: BT = 0.6 </description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>EO_PACKET_DIS</name>
	<description>Disable the end of packet detection

0: End of packet detection enabled
1: End of pakcet detection disabled </description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>TXDATA_INV</name>
	<description>Select polarity of the modulation prior to the pulse shaping
0: Normal operation
1: Invert the modulation signal </description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>GAUSS_86</name>
	<description>Select the output resolution in the analog signal path
0: 8 bit resolution for the shaping signal
1: 6 bit resolution for the shaping signal </description>
	<access>read-write</access>
	<bitRange>[9:9]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>GAUSS_INV</name>
	<description>Select polarity of the analog modulation path
0: Normal operation
1: Invert the signal in the analog signal path </description>
	<access>read-write</access>
	<bitRange>[8:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DELAY</name>
	<description>Additional delay in analog signal path in RCLK cycles </description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>MODINDEX</name>
	<description>Modulation Index selection
0:h = 1/2 (&#206;&#148;f = 250 kHz)
1: h = 1/4 (&#206;&#148;f = 125 kHz)
2: h = 17/32 (&#206;&#148;f = 266 kHz)
3: h = 35/64 (&#206;&#148;f = 273 kHz) </description>
	<access>read-write</access>
	<bitRange>[5:4]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SD_ORDER_TX</name>
	<description>Order of the sigma-delta modulator in TX mode </description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SD_ORDER_RX</name>
	<description>Order of the sigma-delta modulator in RX mode </description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_SYNTH_CTRL2_FTDF_REG</name>
	
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x0000001b</resetValue>
	<resetMask>0x00003fff</resetMask>
	<fields>
	<field>
	<name>FTDF_MODINDEX</name>
	<description>Modulation Index selection for FTDF
TBD @SR </description>
	<access>read-write</access>
	<bitRange>[13:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>DELAY</name>
	<description>Additional delay in analog signal path in RCLK cycles </description>
	<access>read-write</access>
	<bitRange>[7:6]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SD_ORDER_TX</name>
	<description>Order of the sigma-delta modulator in TX mode </description>
	<access>read-write</access>
	<bitRange>[3:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>SD_ORDER_RX</name>
	<description>Order of the sigma-delta modulator in RX mode </description>
	<access>read-write</access>
	<bitRange>[1:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_SYNTH_CTRL3_REG</name>
	
