wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/doc/DA14681-00.xml
Has meaning only in Manual mode and only when QSPIC_HRDY_MD = 1.</description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>QSPIC_UCODE_START</name>
	<description>QSPIC uCode memory</description>
	<addressOffset>0x00000040</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_UCODE_X</name>
	<description>The first position of the memory (16 words x 32 bits) where a microcode should be placed ( X = 0 to 15). This microcode describes the initialization process of the external flash device.</description>
	<access>read-write</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>QSPIC_WRITEDATA_REG</name>
	<description>Write data to SPI Bus for the Manual mode</description>
	<addressOffset>0x00000018</addressOffset>
	<size>32</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x7fffffff</resetMask>
	<fields>
	<field>
	<name>QSPIC_WRITEDATA</name>
	<description>Writing to this register is generating a data transfer from the controller to the external memory device. The data written in this register is then transferred to the memory using the selected mode of the SPI bus (SPI, Dual SPI, Quad SPI). The data size of the access to this register can be 32-bits / 16-bits/ 8-bits and is equal to the number of the transferred bits.
This register has meaning only when the controller is in Manual mode.</description>
	<access>write-only</access>
	<bitRange>[31:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>QUAD</name>
	<version>1.0</version>
	<description>QUAD registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50001a00</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>10</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>QDEC_CLOCKDIV_REG</name>
	<description>Quad decoder clock divider register</description>
	<addressOffset>0x00000008</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>clock_divider</name>
	<description>Contains the number of the input clock cycles minus one, that are required to generate one logic clock cycle. </description>
	<access>read-write</access>
	<bitRange>[9:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>QDEC_CTRL_REG</name>
	<description>Quad decoder control register</description>
	<addressOffset>0x00000000</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000010</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>CHZ_PORT_EN</name>
	<description>'1' : Enable channel</description>
	<access>read-write</access>
	<bitRange>[12:12]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CHY_PORT_EN</name>
	<description>'1' : Enable channel</description>
	<access>read-write</access>
	<bitRange>[11:11]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>CHX_PORT_EN</name>
	<description>'1' : Enable channel</description>
	<access>read-write</access>
	<bitRange>[10:10]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>QD_IRQ_THRES</name>
	<description>The number of events on either counter (X or Y or Z) that need to be reached before an interrupt is generated. If 0 is written, then threshold is considered to be 1. </description>
	<access>read-write</access>
	<bitRange>[9:3]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>QD_IRQ_STATUS</name>
	<description>Interrupt Status. If 1 an interrupt has occured. </description>
	<access>read-only</access>
	<bitRange>[2:2]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>QD_IRQ_CLR</name>
	<description>Writing 1 to this bit clears the interrupt. This bit is autocleared </description>
	<access>read-write</access>
	<bitRange>[1:1]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>QD_IRQ_MASK</name>
	<description>0: interrupt is masked
1: interrupt is enabled </description>
	<access>read-write</access>
	<bitRange>[0:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>QDEC_XCNT_REG</name>
	<description>Counter value of the X Axis</description>
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>X_counter</name>
	<description>Contains a signed value of the events. Zero when channel is disabled </description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>QDEC_YCNT_REG</name>
	<description>Counter value of the Y Axis</description>
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>Y_counter</name>
	<description>Contains a signed value of the events. Zero when channel is disabled</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>QDEC_ZCNT_REG</name>
	<description>Counter value of the Z Axis</description>
	<addressOffset>0x00000006</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000000</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>Z_counter</name>
	<description>Contains a signed value of the events. Zero when channel is disabled</description>
	<access>read-only</access>
	<bitRange>[15:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register></registers>
</peripheral><peripheral>
	<name>RFCU</name>
	<version>1.0</version>
	<description>RFCU registers</description>
	<groupName>Peripheral_Registers</groupName>
	<baseAddress>0x50002000</baseAddress>
	<size>0</size>
	<access>ACCESS</access>
	<addressBlock>
	<offset>0</offset>
	<size>240</size>
	<usage>registers</usage>
</addressBlock>
	<registers>
	<register>
	<name>RF_ADCI_DC_OFFSET_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x00000058</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00008080</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ADC_OFFN_I_RD</name>
	<description>DC offset compensation in the I path (inverting input) in sign-magnitude notarion (i.e. -31 : 1 : 31 mV) </description>
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ADC_OFFP_I_RD</name>
	<description>DC offset compensation in the I path (non-inverting input) in sign-magnitude notarion (i.e. -31 : 1 : 31 mV) </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ADCQ_DC_OFFSET_REG</name>
	<description>Must be Retained</description>
	<addressOffset>0x0000005a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00008080</resetValue>
	<resetMask>0x0000ffff</resetMask>
	<fields>
	<field>
	<name>ADC_OFFN_Q_RD</name>
	<description>DC offset compensation in the Q path (inverting input) in sign-magnitude notarion (i.e. -31 : 1 : 31 mV) </description>
	<access>read-only</access>
	<bitRange>[15:8]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>ADC_OFFP_Q_RD</name>
	<description>DC offset compensation in the Q path (non-inverting input) in sign-magnitude notarion (i.e. -31 : 1 : 31 mV) </description>
	<access>read-only</access>
	<bitRange>[7:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ADC_CTRL1_REG</name>
	
