wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/doc/DA14681-00.xml
	<addressOffset>0x000000a2</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000004</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>iff_en_ftdf_dcf_tx</name>
	<description>DCF timer for iff_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>iff_en_ftdf_dcf_rx</name>
	<description>DCF timer for iff_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG18_BLE_REG</name>
	
	<addressOffset>0x00000024</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000004</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>adc_en_ble_dcf_tx</name>
	<description>DCF timer for adc_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>adc_en_ble_dcf_rx</name>
	<description>DCF timer for adc_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG18_FTDF_REG</name>
	
	<addressOffset>0x000000a4</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000004</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>adc_en_ftdf_dcf_tx</name>
	<description>DCF timer for adc_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>adc_en_ftdf_dcf_rx</name>
	<description>DCF timer for adc_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG19_BLE_REG</name>
	
	<addressOffset>0x00000026</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>vco_en_ble_dcf_tx</name>
	<description>DCF timer for adc_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>vco_en_ble_dcf_rx</name>
	<description>DCF timer for adc_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG19_FTDF_REG</name>
	
	<addressOffset>0x000000a6</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000042</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>vco_en_ftdf_dcf_tx</name>
	<description>DCF timer for vco_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>vco_en_ftdf_dcf_rx</name>
	<description>DCF timer for vco_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG1_BLE_REG</name>
	
	<addressOffset>0x00000002</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000009</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>lna_core_en_ble_dcf_tx</name>
	<description>DCF timer for lna_core_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>lna_core_en_ble_dcf_rx</name>
	<description>DCF timer for lna_core_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG1_FTDF_REG</name>
	
	<addressOffset>0x00000082</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000009</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>lna_core_en_ftdf_dcf_tx</name>
	<description>DCF timer for lna_core_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>lna_core_en_ftdf_dcf_rx</name>
	<description>DCF timer for lna_core_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG20_BLE_REG</name>
	
	<addressOffset>0x00000028</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>lobuf_md_en_ble_dcf_tx</name>
	<description>DCF timer for lobuf_md_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>lobuf_md_en_ble_dcf_rx</name>
	<description>DCF timer for lobuf_md_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG20_FTDF_REG</name>
	
	<addressOffset>0x000000a8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>lobuf_md_en_ftdf_dcf_tx</name>
	<description>DCF timer for lobuf_md_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>lobuf_md_en_ftdf_dcf_rx</name>
	<description>DCF timer for lobuf_md_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG21_BLE_REG</name>
	
	<addressOffset>0x0000002a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>cp_en_ble_dcf_tx</name>
	<description>DCF timer for cp_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>cp_en_ble_dcf_rx</name>
	<description>DCF timer for cp_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG21_FTDF_REG</name>
	
	<addressOffset>0x000000aa</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>cp_en_ftdf_dcf_tx</name>
	<description>DCF timer for cp_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>cp_en_ftdf_dcf_rx</name>
	<description>DCF timer for cp_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG22_BLE_REG</name>
	
