wgy504/ihu/DA1468x_SDK_BTLE_v_1.0.6/doc/DA14681-00.xml
	<addressOffset>0x00000036</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>div2_en_ble_dcf_tx</name>
	<description>DCF timer for div2_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>div2_en_ble_dcf_rx</name>
	<description>DCF timer for div2_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG27_FTDF_REG</name>
	
	<addressOffset>0x000000b6</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000063</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>div2_en_ftdf_dcf_tx</name>
	<description>DCF timer for div2_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>div2_en_ftdf_dcf_rx</name>
	<description>DCF timer for div2_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG28_BLE_REG</name>
	
	<addressOffset>0x00000038</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000a5</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>cp_bias_sh_open_ble_dcf_tx</name>
	<description>DCF timer for cp_bias_sh_open in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>cp_bias_sh_open_ble_dcf_rx</name>
	<description>DCF timer for cp_bias_sh_open in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG28_FTDF_REG</name>
	
	<addressOffset>0x000000b8</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000a5</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>cp_bias_sh_open_ftdf_dcf_tx</name>
	<description>DCF timer for cp_bias_sh_open in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>cp_bias_sh_open_ftdf_dcf_rx</name>
	<description>DCF timer for cp_bias_sh_open in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG29_BLE_REG</name>
	
	<addressOffset>0x0000003a</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000a5</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>vco_bias_sh_open_ble_dcf_tx</name>
	<description>DCF timer for vco_bias_sh_open in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>vco_bias_sh_open_ble_dcf_rx</name>
	<description>DCF timer for vco_bias_sh_open in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG29_FTDF_REG</name>
	
	<addressOffset>0x000000ba</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x000000a5</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>vco_bias_sh_open_ftdf_dcf_tx</name>
	<description>DCF timer for vco_bias_sh_open in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>vco_bias_sh_open_ftdf_dcf_rx</name>
	<description>DCF timer for vco_bias_sh_open in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG2_BLE_REG</name>
	
	<addressOffset>0x00000004</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000009</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>lna_cgm_en_ble_dcf_tx</name>
	<description>DCF timer for lna_cgm_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>lna_cgm_en_ble_dcf_rx</name>
	<description>DCF timer for lna_cgm_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG2_FTDF_REG</name>
	
	<addressOffset>0x00000084</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000009</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>lna_cgm_en_ftdf_dcf_tx</name>
	<description>DCF timer for lna_cgm_en in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>lna_cgm_en_ftdf_dcf_rx</name>
	<description>DCF timer for lna_cgm_en in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG30_BLE_REG</name>
	
	<addressOffset>0x0000003c</addressOffset>
	<size>16</size>
	<access>read-write</access>
	<resetValue>0x00000006</resetValue>
	<resetMask>0x000003ff</resetMask>
	<fields>
	<field>
	<name>iffmix_bias_sh_open_ble_dcf_tx</name>
	<description>DCF timer for iffmix_bias_sh_open in tx mode</description>
	<access>read-write</access>
	<bitRange>[9:5]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field><field>
	<name>iffmix_bias_sh_open_ble_dcf_rx</name>
	<description>DCF timer for iffmix_bias_sh_open in rx mode</description>
	<access>read-write</access>
	<bitRange>[4:0]</bitRange>
	<enumeratedValues><name>ENUM</name></enumeratedValues>
</field></fields>
</register><register>
	<name>RF_ENABLE_CONFIG30_FTDF_REG</name>
	
